Tekla Open API Reference for Tekla Structures 2025
AnalysisModelSeismicProperties Properties
The AnalysisModelSeismicProperties type exposes the following members.
Properties
Name | Description
SeismicIncludeSelfWeightMass
 Indicates whether the selfweight is included.
SeismicMassLoadGroupFactors
 The factors of the mass load group.
SeismicMassLoadGroupIds
 The identifier of the mass load group.
SeismicParameters
 The seismic parameters.
Top
See Also
Reference
AnalysisModelSeismicProperties Class
Tekla.Structures.Analysis Namespace